Revit 2015 API
Units Methods
The Units type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetDisplayUnitType |  Obsolete.
 Gets the display unit for the UT_Length unit type.
GetFormatOptions
 Gets the default FormatOptions for a unit type.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetModifiableUnitTypes
 Gets all unit types for which the default FormatOptions can be modified.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsModifiableUnitType
 Checks whether the default FormatOptions can be modified for a given unit type.
IsValidDecimalSymbolAndGrouping |  Obsolete.
 Checks if a combination of decimal symbol and digit grouping settings is allowed.
SetDecimalSymbolAndGrouping |  Obsolete.
 Sets the decimal symbol and digit grouping.
SetFormatOptions
 Sets the default FormatOptions for a unit type.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
Units Class
Autodesk.Revit.DB Namespace